Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипКонтрагента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактныйТелефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолКлиента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойДоговор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникиИнформацииОКомпании</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникПолученияИнформацииОКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Питомцы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидПитомца</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыПитомцев</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПородаПитомца</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПородыПитомцев</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КличкаПитомца</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>99</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаРожденияПитомца</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ТипыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Клиент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поставщик</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Контрагенты/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость(); 
	ИзменитьЗаголовок(); 

КонецПроцедуры 

&НаКлиенте
Процедура УстановитьВидимость()  
	
	Если Объект.ТипКонтрагента = ПредопределенноеЗначение("Перечисление.ТипыКонтрагентов.Клиент")Тогда
		Элементы.ДатаРождения.Видимость = Истина;
		Элементы.ПолКлиента.Видимость = Истина;
		Элементы.ИсточникиИнформацииОКомпании.Видимость = Истина;
		Элементы.ОсновнойДоговор.Видимость = Ложь;
		Элементы.Питомцы.Видимость = Истина;
	Иначе 
        Элементы.ДатаРождения.Видимость = Ложь;
		Элементы.ПолКлиента.Видимость = Ложь;
		Элементы.ИсточникиИнформацииОКомпании.Видимость = Ложь;
		Элементы.ОсновнойДоговор.Видимость = Истина;
		Элементы.Питомцы.Видимость = Ложь; 
	КонецЕсли;
	
КонецПроцедуры    

&НаКлиенте
Процедура ТипКонтрагентаПриИзменении(Элемент)
	УстановитьВидимость();  
	ИзменитьЗаголовок(); 
	ИспользоватьРодитель();
	
КонецПроцедуры

Процедура ИзменитьЗаголовок()
	
	Если Объект.ТипКонтрагента = ПредопределенноеЗначение("Перечисление.ТипыКонтрагентов.Клиент")Тогда
		Элементы.Наименование.Заголовок = "Ф.И.О. клиента";  
		
		Иначе 
		Элементы.Наименование.Заголовок = "Наименование";
	КонецЕсли; 
	
КонецПроцедуры


&НаКлиенте
Процедура ИспользоватьРодитель()
	
	Если Объект.ТипКонтрагента = ПредопределенноеЗначение("Перечисление.ТипыКонтрагентов.Клиент")Тогда
    Объект.Родитель = ПредопределенноеЗначение("Справочник.Контрагенты.Клиенты"); 
Иначе 
	Объект.Родитель = ПредопределенноеЗначение("Справочник.Контрагенты.Поставщики");
КонецЕсли;
КонецПроцедуры
